In [1]:
# 파생변수의 정의 : 기존 변수를 조합하여, 만들어내는 새로운 변수
# 예시 : 기온/습도/풍속을 조합하여 만든 체감온도 변수
# 물건 주문건수와 환불건수를 조합하여 만든 환불 비율 변수
# 기존 방문 매장정보를 활용한 주 방문 매장 변수

# 이걸로 성능이 좋아지기도하고 새 인사이트를 얻기도함

In [2]:
# numpy - where()
# 조건에 따라 두개의 출력을 내는 함수
# if() 함수를 대체할수 있으며 조건, True일때 반환값, False 일때 반환값을 차례대로 기입 

# pandas - rename()
# 데이터프레임의 변수명을 변경할 때 사용
# columns 인자에 기존 변수명과 신규변수명의 쌍을 딕셔너리로 구성하여 입력

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
df = pd.read_csv("iris.csv")
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [6]:
#numpy where
df["is_setosa"] = np.where(df["Species"] == "setosa", 1, 0)
df.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  is_setosa
0           5.1          3.5           1.4          0.2  setosa          1
1           4.9          3.0           1.4          0.2  setosa          1
2           4.7          3.2           1.3          0.2  setosa          1
3           4.6          3.1           1.5          0.2  setosa          1
4           5.0          3.6           1.4          0.2  setosa          1

In [7]:
df.tail()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa
145,6.7,3.0,5.2,2.3,virginica,0
146,6.3,2.5,5.0,1.9,virginica,0
147,6.5,3.0,5.2,2.0,virginica,0
148,6.2,3.4,5.4,2.3,virginica,0
149,5.9,3.0,5.1,1.8,virginica,0

In [8]:
pd.crosstab(df["Species"], df["is_setosa"]) # 전체 변수 가능 정보보기 (row, column)

is_setosa    0   1
Species
setosa       0  50
versicolor  50   0
virginica   50   0

In [9]:
# where 와 같은거
df["is_setosa2"] = (df["Species"] == "setosa") + 0 
df["is_setosa3"] = (df["Species"] == "setosa") *1
df.head()

,Sepal.Length,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa2,is_setosa3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [11]:
# rename
df = df.rename(columns = {"Sepal.Length" : "SL"})
df.head()

,SL,Sepal.Width,Petal.Length,Petal.Width,Species,is_setosa,is_setosa2,is_setosa3
0,5.1,3.5,1.4,0.2,setosa,1,1,1
1,4.9,3.0,1.4,0.2,setosa,1,1,1
2,4.7,3.2,1.3,0.2,setosa,1,1,1
3,4.6,3.1,1.5,0.2,setosa,1,1,1
4,5.0,3.6,1.4,0.2,setosa,1,1,1

In [12]:
# pandas - apply()
# row, column 방향으로 일괄계산하는 메서드
# axis 인자 설정으로 연산방향 설정 (0 : row, 1 : col)
# 사용자 정의 함수 or 람다식으로 복잡한 연산가능
# 이걸 잘쓰는게 매우중요함 ★

# pandas - astype()
# 시리즈의 속성을 변경할떄 사용
# int, float, str 등 원하는 속성을 지정.변경

In [13]:
bike = pd.read_csv("bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [14]:
bike.columns

Index(['datetime', 'season', 'holiday', 'workingday', 'weather', 'temp',
       'atemp', 'humidity', 'windspeed', 'casual', 'registered', 'count'],
      dtype='object')

In [20]:
# loc vs iloc 
print(bike.iloc[:4, 9:11]) # only integer , row 가 4개 (0123)
print(bike.loc[:4, ["casual", "registered"]]) # row 가 5개 (01234)
print( bike.loc[:4, "casual": "registered"])

   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1
   casual  registered
0       3          13
1       8          32
2       5          27
3       3          10
4       0           1

In [22]:
bike_sub = bike.loc[:4,"casual": "registered"]

In [23]:
bike_sub.sum()

casual        19
registered    83
dtype: int64

In [24]:
bike_sub.sum(axis=1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [25]:
bike_sub.apply(func = sum)

casual        19
registered    83
dtype: int64

In [26]:
bike_sub.apply(func = sum, axis = 1)

0    16
1    40
2    32
3    13
4     1
dtype: int64

In [27]:
# bike_sub.mean()
bike_sub.apply(func = pd.Series.mean)

casual         3.8
registered    16.6
dtype: float64

In [28]:
bike_sub.apply(func = lambda x : round(x.mean()))

casual         4
registered    17
dtype: int64

In [29]:
bike_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   casual      5 non-null      int64
 1   registered  5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

In [30]:
bike_sub["casual"]

0    3
1    8
2    5
3    3
4    0
Name: casual, dtype: int64

In [33]:
bike_sub["casual"].astype("str") + "대"

0    3대
1    8대
2    5대
3    3대
4    0대
Name: casual, dtype: object

In [36]:
bike = pd.read_csv("bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [37]:
bike["datetime"][:3]

0    2011-01-01 00:00:00
1    2011-01-01 01:00:00
2    2011-01-01 02:00:00
Name: datetime, dtype: object

In [38]:
bike["datetime"][:3].str.slice(0,4)

0    2011
1    2011
2    2011
Name: datetime, dtype: object

In [39]:
bike["datetime"][:3].str.slice(5,7)

0    01
1    01
2    01
Name: datetime, dtype: object

In [40]:
bike_time = pd.to_datetime(bike["datetime"][:3])

In [41]:
bike_time

0   2011-01-01 00:00:00
1   2011-01-01 01:00:00
2   2011-01-01 02:00:00
Name: datetime, dtype: datetime64[ns]

In [42]:
bike_time.dt.year

0    2011
1    2011
2    2011
Name: datetime, dtype: int64

In [43]:
print(bike_time.dt.year)
print(bike_time.dt.month)
print(bike_time.dt.hour)
print(bike_time.dt.weekday)

0    2011
1    2011
2    2011
Name: datetime, dtype: int64
0    1
1    1
2    1
Name: datetime, dtype: int64
0    0
1    1
2    2
Name: datetime, dtype: int64
0    5
1    5
2    5
Name: datetime, dtype: int64

In [ ]:
# pandas - get dummies()
# 편리한 가변수 생성 (원핫인코딩) 을 도와주는 함수
# cols 인자에 명목형 변수지정 및 처리가능
# drop_first 인자에 true 를 입력하면 마지막 가변수 제외 후 생성

In [44]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [50]:
bike_dum = pd.get_dummies(data = bike, columns=["season"])
bike_dum.head(2)

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_1,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0,3,13,16,1,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0,8,32,40,1,0,0,0

In [52]:
bike_dum = pd.get_dummies(data = bike, columns=["season"], drop_first=True) # 첫번째꺼는 날림 
bike_dum.head()

,datetime,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_2,season_3,season_4
0,2011-01-01 00:00:00,0,0,1,9.84,14.395,81,0.0,3,13,16,0,0,0
1,2011-01-01 01:00:00,0,0,1,9.02,13.635,80,0.0,8,32,40,0,0,0
2,2011-01-01 02:00:00,0,0,1,9.02,13.635,80,0.0,5,27,32,0,0,0
3,2011-01-01 03:00:00,0,0,1,9.84,14.395,75,0.0,3,10,13,0,0,0
4,2011-01-01 04:00:00,0,0,1,9.84,14.395,75,0.0,0,1,1,0,0,0

In [ ]:
# 문제1

In [53]:
bike["diff"] = bike["temp"] - bike["atemp"]
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,diff
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,-4.555
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,-4.615

In [54]:
bike["diff"].abs().mean()

3.509198511850083

In [55]:
# 문제 2

In [56]:
bike["datetime"] = pd.to_datetime(bike["datetime"])

In [57]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,diff
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,-4.555
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,-4.615

In [58]:
bike["date"] = bike["datetime"].dt.date

In [59]:
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,diff,date
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,-4.555,2011-01-01
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,-4.615,2011-01-01

In [60]:
bike_agg = bike.groupby("date")["casual"].max()
bike_agg.head()

date
2011-01-01    47
2011-01-02    20
2011-01-03    14
2011-01-04    18
2011-01-05    12
Name: casual, dtype: int64

In [61]:
bike_agg_up25 = bike_agg[bike_agg>25] # pd.series 라서 loc 을 안쓴것
bike_agg_up25.head()

date
2011-01-01    47
2011-01-15    33
2011-01-16    35
2011-02-06    52
2011-02-12    47
Name: casual, dtype: int64

In [63]:
len(bike_agg_up25)

384

In [64]:
bike_agg = bike.groupby("date")["casual"].max().reset_index() # series -> df 로 변환, 굉장히 많이씀 ★
bike_agg.head()

         date  casual
0  2011-01-01      47
1  2011-01-02      20
2  2011-01-03      14
3  2011-01-04      18
4  2011-01-05      12

In [65]:
# 문제 3

In [66]:
bike.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10886 entries, 0 to 10885
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   datetime    10886 non-null  datetime64[ns]
 1   season      10886 non-null  int64
 2   holiday     10886 non-null  int64
 3   workingday  10886 non-null  int64
 4   weather     10886 non-null  int64
 5   temp        10886 non-null  float64
 6   atemp       10886 non-null  float64
 7   humidity    10886 non-null  int64
 8   windspeed   10886 non-null  float64
 9   casual      10886 non-null  int64
 10  registered  10886 non-null  int64
 11  count       10886 non-null  int64
 12  diff        10886 non-null  float64
 13  date        10886 non-null  object
dtypes: datetime64[ns](1), float64(4), int64(8), object(1)
memory usage: 1.2+ MB

In [67]:
bike["hour"] = bike["datetime"].dt.hour
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,diff,date,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,-4.555,2011-01-01,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,-4.615,2011-01-01,1

In [69]:
bike_hour = bike.groupby("hour")["registered"].mean().reset_index()
bike_hour

    hour  registered
0      0   44.826374
1      1   27.345815
2      2   18.080357
3      3    9.076212
4      4    5.144796
5      5   18.311947
6      6   72.109890
7      7  202.202198
8      8  341.226374
9      9  190.824176
10    10  128.973626
11    11  150.621978
12    12  187.677632
13    13  183.728070
14    14  166.853070
15    15  178.269737
16    16  241.289474
17    17  393.324561
18    18  369.462719
19    19  266.203947
20    20  191.785088
21    21  144.802632
22    22  110.973684
23    23   74.046053

In [73]:
bike_hour.loc[bike_hour["registered"] == bike_hour["registered"].max(), :]

    hour  registered
17    17  393.324561

In [83]:
bike_hour.loc[bike_hour["registered"].idxmax(), : ]

hour           17.000000
registered    393.324561
Name: 17, dtype: float64

In [82]:
bike_hour.idxmax()

hour          23
registered    17
dtype: int64